import React, {FC} from 'react';
import cl from "./pagesStyles/taskPage.module.css"

const TaskPage: FC = () => {

    const text = "" +
        "                Завдання\n" +
        "\n" +
        "                    Як інженер-програміст у компанії Mocoding, вам будуть надані різноманітні складні завдання, які збережуть ваш інтерес та\n" +
        "                    сприятимуть вашому професійному зростанню. І це одне з таких завдань. Вам потрібно створити наступне:\n" +
        "\n" +
        "                        * Задано бінарний файл та порожню карту світу. Згенеруйте теплову карту глобальних температур поверхні моря, схожу на\n" +
        "                         зображення вище.\n" +
        "                        * Створіть демонстраційний веб-сайт, що дозволяє користувачам завантажувати бінарний файл та відображати отримане\n" +
        "                         зображення.\n" +
        "\n" +
        "\n" +
        "                Технічні вимоги:\n" +
        "\n" +
        "                    * Проект повинен бути розміщений на вашому обліковому записі GitHub та бути відкритим для публіки.\n" +
        "                    * Використовуйте лише Typescript, який транспілюється в ES6+.\n" +
        "                    * Використовуйте Node 18 та PNPM як менеджер пакетів.\n" +
        "                    * Використовуйте React для веб-сайту.\n" +
        "                    * Використовуйте робочі області (workspaces) - створіть окремі пакети для веб-сайту та компоненту створення зображення.\n" +
        "                    * Використовуйте mocha та chai для модульних тестів.\n" +
        "                    * Порожнє зображення світу вважається постійним і може бути включеним як частина пакетів.\n" +
        "                    * Бінарний файл не вважається постійним і надається лише як приклад.\n" +
        "\n" +
        "\n" +
        "                Очікування\n" +
        "\n" +
        "                    Метою цього завдання не є створення готового до використання виробничого коду, а оцінка здатності кандидата до його\n" +
        "                    написання. При виконанні цього завдання будь ласка, зверніть особливу увагу на наступне:\n" +
        "\n" +
        "                        * Спільний стиль кодування\n" +
        "                        * Правильне використання інструментів та фреймворків\n" +
        "                        * Обробка винятків\n" +
        "                        * Модульні тести";


    return (
        <div className={cl.wrapper}>
            <pre className={cl.description}>
                {text}
            </pre>
        </div>
    );
};

export default TaskPage;